cfg/DataProcessors/ПомощникПересчетаВзносовСКоэффициентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПересчетаВзносовСКоэффициентом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВзносыФОТ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяНалоговойДекларации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаВзноса</Name>
							<Comment>База налога с учетом ограничений</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСтавки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатНовый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/InformationRegisters/КоэффициентыСтавкиВзносовФОТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КоэффициентыСтавкиВзносовФОТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоэффициентСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>База2014</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗЛ2014</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВажнаяИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/DataProcessors/ПомощникПересчетаВзносовСКоэффициентом/Forms/Форма/Ext/Form/Module.bsl
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
	ОбработкаКомментариев.УдалитьСообщения();
	
	ПараметрОтбора = Новый Структура();
	ПараметрОтбора.Вставить("Отметка", Истина);
	СписокДокументов = ВзносыФОТ.Выгрузить(ПараметрОтбора,"Документ,Сотрудник");
	СписокДокументов.Сортировать("Документ");
	
	ИндексСтрокиТаблицы = СписокДокументов.Количество();
	ТекущийДокумент = Неопределено;
	Сотрудники = Новый СписокЗначений();
	
	Пока ИндексСтрокиТаблицы > 0 Цикл
		ИндексСтрокиТаблицы = ИндексСтрокиТаблицы - 1;
		
		СтрокаТаблицы = СписокДокументов[ИндексСтрокиТаблицы];
		
		Если СтрокаТаблицы.Документ = ТекущийДокумент Тогда
			Сотрудники.Добавить(СтрокаТаблицы.Сотрудник);
			Если ИндексСтрокиТаблицы <>0 Тогда
				Продолжить;
			Иначе
				ПересчитатьДокумент(ТекущийДокумент, Сотрудники, ОбработкаКомментариев);
				Продолжить;
			КонецЕсли;
		ИначеЕсли ТекущийДокумент <> Неопределено Тогда
			ПересчитатьДокумент(ТекущийДокумент, Сотрудники, ОбработкаКомментариев);
		КонецЕсли;	
		
		ТекущийДокумент = СтрокаТаблицы.Документ;
		Сотрудники.Очистить();
		Сотрудники.Добавить(СтрокаТаблицы.Сотрудник);
		
		Если ИндексСтрокиТаблицы = 0 Тогда
			ПересчитатьДокумент(ТекущийДокумент, Сотрудники, ОбработкаКомментариев);
		КонецЕсли;
		
	КонецЦикла;
	
	СписокДокументов.Очистить();
	Автозаполнение();
	
КонецПроцедуры

Процедура ПересчитатьДокумент(Документ, Сотрудники, ОбработкаКомментариев)
	
	Если Документ <> Неопределено Тогда
		//Попытка пересчета
		ДокументОбъект = Документ.ПолучитьОбъект();
		Попытка
			ДокументОбъект.ПерерассчитатьВзносыФОТ(Сотрудники);
			ОбщегоНазначения.КомментарийРасчета(Строка(ДокументОбъект) + НСтр("ru=' обработан успешно. ';uk=' оброблений успішно. '"), Заголовок, "Открыть", Документ);
		Исключение
				ОбщегоНазначения.КомментарийРасчета("Документ " + Строка(ДокументОбъект) + НСтр("ru=' не может быть перерассчитан!"
"';uk=' не може бути перерозрахований!"
"'") + ОписаниеОшибки(), , "Открыть", Документ,Перечисления.ВидыСообщений.ВажнаяИнформация);
		КонецПопытки;
	КонецЕсли;
	
	ОбработкаКомментариев.ПоказатьСообщения();
	
КонецПроцедуры	

Процедура ЗаполнитьНажатие(Элемент)
	
	ПроверкаЗаполнения();
	Автозаполнение();
	
КонецПроцедуры

Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(Организация) Тогда	
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РасчетныйПериод) Тогда	
    	РасчетныйПериод = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	ЗагрузитьКоэффициент();
	СтрокаПериод = РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(РасчетныйПериод);
КонецПроцедуры

Процедура СтрокаПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, РасчетныйПериод, ЭтаФорма);
    ЗагрузитьКоэффициент()
	
КонецПроцедуры

Процедура СтрокаПериодОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура СтрокаПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	РаботаСДиалогами.РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, РасчетныйПериод, СтрокаПериод);
    Элемент.Значение = РаботаСДиалогами.ДатаКакМесяцПредставление(РасчетныйПериод);
    ЗагрузитьКоэффициент()
	
КонецПроцедуры

Процедура ОрганизацияПриИзменении(Элемент)
	ЗагрузитьКоэффициент()
КонецПроцедуры

Процедура ЗагрузитьКоэффициент()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасчетныйПериод",РасчетныйПериод);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	КоэффициентыСтавкиВзносовФОТ.КоэффициентСтавки
	|ИЗ
	|	РегистрСведений.КоэффициентыСтавкиВзносовФОТ КАК КоэффициентыСтавкиВзносовФОТ
	|ГДЕ
	|	КоэффициентыСтавкиВзносовФОТ.Организация = &Организация
	|	И КоэффициентыСтавкиВзносовФОТ.МесяцНачисления = &РасчетныйПериод";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоэффициентСтавки = ?(Выборка.КоэффициентСтавки = 0, 1, Выборка.КоэффициентСтавки);
	Иначе
		КоэффициентСтавки = 1;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПроверкаЗаполнения()
	
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не выбрана организация!';uk='Не обрана організація!'"), Отказ);
		Возврат;
	КонецЕсли;
	Если СтрокаПериод = "" Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не выбран расчетный период!';uk='Не обраний розрахунковий період!'"), Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
